---
kind: property
id: P:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.IsEmpty
source: html/3b65b2e6-e868-09bf-9c35-a92c083aeaf2.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.